# პრობლემა შემდგომშია, უნდა გავაკეთო პროგრამა სადაც მომხმარებელი შემოიტანს
# 3 რიცხს და საბოლოოდ უნდა გამოვიტანოთ ტერმინალში 3 რიცხვის ნამრავლი

# 1) როგორ შემოვატანინო მომხმარებელს მნიშვნელობა ტერმინალიდან?
# ა) input() ფუნქციის გამოყენებით

# 2) როგორ უნდა დავბეჭდოთ ტერმინალში 3 რცხვის ნამრავლი?
# ა) მე რომ მნიშვნელობა ტერმინალში დავბეჭდო მჭირდება print() ფუქნცია
# ბ) მე რომ რიცხვები გადავამრავლო მჭირდება * 

# ამოხსნა

# მე თუ შემოტანილ მნიშვნელობებს არ გარდავქმნი ნამდვილ როცხვებად მაშინ
# ეს კოდი შედეგად გამომიტანს error_ს იმიტომ, რომ input()_იდან შემოტანილი ნებისმიერი
# მნიშვნელობა არის string

# ეს შეცდომა რომ მოვიცილო მჭირდება int() ფუნქცია რომელიც გადაიყვანს ნამდვილ რიცხვებად

num1 = int(input("Please eneter first number: "))
num2 = int(input("Please eneter second number: "))
num3 = int(input("Please eneter third number: "))

print(num1 * num2 * num3)